#include<cstdio>
#include<cstdlib>
char migong[12][17][60] = {
{},
{
"+------------------------------------------------+\n",
"|P   ########################                    |\n",
"|###      ##    ##         ## ################## |\n",
"|## # ### ## ## ## ####### #  #                  |\n",
"|#### ### ##### ## #       # ## #################|\n",
"|#### ###       ## # ####### ##                  |\n",
"|#### ############ #         ################### |\n",
"|#### ############ ###########                   |\n",
"|####                          ##################|\n",
"|#################### ###########################|\n",
"|#################### ###########################|\n",
"|###################   ##########################|\n",
"|###################   ##########################|\n",
"|###################   ##########################|\n",
"+------------------------------------------------+\n"
},
{
"##################################################\n",
"#P                                               #\n",
"# # # # #### ################################### #\n",
"# # # ###    #                                   #\n",
"# ### ### #### ################### ###############\n",
"# #       #### #                   #             #\n",
"# #   ## ##### # ################### ########### #\n",
"# ###### ##### # ################### ########### #\n",
"#              # ################### ########### #\n",
"################ ############################### #\n",
"#                                                #\n",
"##################################################\n",
"##################################################\n",
"##################################################\n",
"##################################################\n"
}
};
// 12 21
struct node{
	int x;
	int y;
};
struct node _start[12];
struct node _end;
struct node _now;
void setup(){
	_start[1].x = 12;
	_start[1].y = 21;
	_start[2].x = 10;
	_start[2].y = 1;
	_end.x = 1;
	_end.y = 1;
	return ;
}
using namespace std;

void print(int n,int x,int y);
int main(void){
	setup();
	system("title 迷宫1.0.0");
	printf("欢迎使用迷宫1.0.0\n请输入关卡号(1-10):");
	int n;
	scanf("%d",&n);
	while(n<=0||n>10){
		printf("错误!请重新输入(1-10):");
		scanf("%d",&n);
	}
	system("cls");
	_now.x = _start[n].x;
	_now.y = _start[n].y;
	do{
		print(n,_now.x,_now.y);
		printf("请输入您要进行的操作(w:上;a:左;s:下;d:右;):");
		char c;
		scanf("%c",&c);
		switch(c){
			case 'w':_now.x--;break;
			case 's':_now.x++;break;
			case 'a':_now.y--;break;
			case 'd':_now.y++;break;
		}
		if(_now.x>0&&_now.x<15&&_now.y>0&&_now.y<50){
			if(migong[n][_now.x][_now.y]==' '||migong[n][_now.x][_now.y]=='P'){
				system("cls");
				continue;
			}
		}
		printf("撞墙了！！！");
		switch(c){
			case 'w':_now.x++;break;
			case 's':_now.x--;break;
			case 'a':_now.y++;break;
			case 'd':_now.y--;break;
		}
		system("pause");
		system("cls");
	}while(!(_now.x==_end.x && _now.y==_end.y));
	printf("您通关了！\n");
	system("pause");
	return 0;
}
void print(int n,int x,int y)
{
	for(int i = 0 ; i < 15 ; i ++){
		for(int j = 0 ; j < 50 ; j ++){
			if(x == _end.x && y == _end.y){
				printf("P");
			}
			if(x == i && y == j){
				printf("O");
			}
			else{
				printf("%c",migong[n][i][j]);
			}
		}
		printf("\n");
	}
	return ;
}
